app/controllers/daily_trips_controller.rb

    def create
        @daily_trip = DailyTrip.where(date: params[:date]).order(created_at: :desc)
        if @daily_trip.present?
            @row = @daily_trip.first.row
            @column = @daily_trip.first.column
            @seat = @daily_trip.first.seat_number
            case @row
            when 1
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 4, seat_number: @seat+1) if @column == 3
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 7, seat_number: @seat+1) if @column == 4
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 8, seat_number: @seat+1) if @column == 7
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 9, seat_number: @seat+1) if @column == 8
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 10, seat_number: @seat+1) if @column == 9
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 3, seat_number: @seat+1) if @column == 10
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 5, seat_number: @seat+1) if @column == 2
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 12, seat_number: @seat+1) if @column == 1
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 1, seat_number: @seat+1) if @column == 12
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 6, seat_number: @seat+1) if @column == 5
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 11, seat_number: @seat+1) if @column == 6
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 2, seat_number: @seat+1) if @column == 11
                return render json: {message: "Seat Booked Successfully"}, status: 200
            when 2
                return render json: {message: "All seats are filled"}, status: 422 if @column == 5
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 5, seat_number: @seat+1) if @column == 2
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 12, seat_number: @seat+1) if @column == 1
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 9, seat_number: @seat+1) if @column == 12
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 4, seat_number: @seat+1) if @column == 3
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 7, seat_number: @seat+1) if @column == 4
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 8, seat_number: @seat+1) if @column == 7
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 9, seat_number: @seat+1) if @column == 8
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 10, seat_number: @seat+1) if @column == 9
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 1, seat_number: @seat+1) if @column == 10
                return render json: {message: "Seat Booked Successfully"}, status: 200
            when 3
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 4, seat_number: @seat+1) if @column == 1
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 5, seat_number: @seat+1) if @column == 4
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 6, seat_number: @seat+1) if @column == 5
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 7, seat_number: @seat+1) if @column == 6
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 4, column: 1, seat_number: @seat+1) if @column == 7
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 3, column: 1, seat_number: @seat+1) if @column == 10
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 2, column: 2, seat_number: @seat+1) if  @column == 11
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 4, column: 3, seat_number: @seat+1) if @column == 9
                return render json: {message: "Seat Booked Successfully"}, status: 200
            when 4
                @daily_trip = DailyTrip.create!(name: params[:name], date: params[:date], row: 1, column: 1, seat_number: @seat+1) if @column == 1
---
SELECT "daily_trips".* FROM "daily_trips" WHERE "daily_trips"."date" = $1 ORDER BY "daily_trips"."created_at" DESC  [["date", "2021-03-02 00:00:00"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 3], ["seat_number", 1], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:10:01.768565"], ["updated_at", "2021-03-02 10:10:01.768565"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 4], ["seat_number", 2], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:58:57.293522"], ["updated_at", "2021-03-02 11:58:57.293522"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 4], ["seat_number", 2], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:24:53.073459"], ["updated_at", "2021-03-02 10:24:53.073459"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 8], ["seat_number", 4], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:15.634773"], ["updated_at", "2021-03-02 11:59:15.634773"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 8], ["seat_number", 4], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:30:25.653008"], ["updated_at", "2021-03-02 10:30:25.653008"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 10], ["seat_number", 6], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:32:31.877347"], ["updated_at", "2021-03-02 10:32:31.877347"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 3], ["seat_number", 7], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:39:32.701524"], ["updated_at", "2021-03-02 10:39:32.701524"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 3], ["seat_number", 7], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:19.634660"], ["updated_at", "2021-03-02 11:59:19.634660"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 5], ["seat_number", 21], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:40.811784"], ["updated_at", "2021-03-02 11:59:40.811784"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 12], ["seat_number", 15], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:31.980500"], ["updated_at", "2021-03-02 11:59:31.980500"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 5], ["seat_number", 26], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:50:29.820851"], ["updated_at", "2021-03-02 11:50:29.820851"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 4], ["seat_number", 8], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:41:19.571559"], ["updated_at", "2021-03-02 10:41:19.571559"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 6], ["seat_number", 9], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:43:07.012228"], ["updated_at", "2021-03-02 10:43:07.012228"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 7], ["seat_number", 10], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:43:11.295064"], ["updated_at", "2021-03-02 10:43:11.295064"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 9], ["seat_number", 11], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:46:05.054647"], ["updated_at", "2021-03-02 10:46:05.054647"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 10], ["seat_number", 12], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:46:22.373734"], ["updated_at", "2021-03-02 10:46:22.373734"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 1], ["seat_number", 13], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:48:28.464339"], ["updated_at", "2021-03-02 10:48:28.464339"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 9], ["seat_number", 23], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:11:18.854643"], ["updated_at", "2021-03-02 11:11:18.854643"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 9], ["seat_number", 11], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:27.618664"], ["updated_at", "2021-03-02 11:59:27.618664"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 2], ["column", 10], ["seat_number", 12], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:28.586233"], ["updated_at", "2021-03-02 11:59:28.586233"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 5], ["seat_number", 15], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 12:12:12.534010"], ["updated_at", "2021-03-02 12:12:12.534010"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 6], ["seat_number", 16], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 12:12:16.766138"], ["updated_at", "2021-03-02 12:12:16.766138"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 4], ["seat_number", 14], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 11:59:30.490543"], ["updated_at", "2021-03-02 11:59:30.490543"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 4], ["column", 1], ["seat_number", 18], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 12:12:33.517422"], ["updated_at", "2021-03-02 12:12:33.517422"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 1], ["seat_number", 14], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 12:11:15.649560"], ["updated_at", "2021-03-02 12:11:15.649560"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 4], ["seat_number", 14], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:58:13.201408"], ["updated_at", "2021-03-02 10:58:13.201408"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 5], ["seat_number", 15], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:59:33.575991"], ["updated_at", "2021-03-02 10:59:33.575991"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 3], ["column", 6], ["seat_number", 16], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:59:43.702247"], ["updated_at", "2021-03-02 10:59:43.702247"]]
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 1], ["seat_number", 14], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 10:58:13.221149"], ["updated_at", "2021-03-02 10:58:13.221149"]]

                return render json: {message: "Seat Booked Successfully"}, status: 200
            end
        else
            @daily_trip = DailyTrip.create!(params.permit(:name, :date).merge(row: 1, column: 3, seat_number: 1))
---
INSERT INTO "daily_trips" ("row", "column", "seat_number", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["row", 1], ["column", 3], ["seat_number", 1], ["name", "sathiyaraj"], ["date", "2021-03-02 00:00:00"], ["created_at", "2021-03-02 12:08:25.614928"], ["updated_at", "2021-03-02 12:08:25.614928"]]