app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("first_name", "last_name", "age", "email", "date_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @profile = Profile.create!(params.permit(:first_name, :last_name, :email, :age, :date_of_birth))

SELECT "profiles".* FROM "profiles"
---
    def index
        @profile = Profile.all